#Додаткові вправи для вступного курсу з питань R (за бажанням)

# 1.	Оберіть набір даних, з яким ви працюєте (або оберіть той, який ми використовували під час курсу, якщо у вас нема ніяких даних). Введіть набір даних у програму R.
# 2.	Попрактикуйтесь у застосуванні функції “mutate ()”, щоб створити нову змінну у вашому наборі даних.
# 3.	Скористайтеся функцією "summarize ()", щоб знайти середнє значення однієї зі змінних. Якщо у вашому наборі даних є змінна типу grouping variable, спробуйте підбити підсумок за цією змінною за допомогою функції “group_by ()”
# 4.	Побудуйте діаграму/фігуру на ваш вибір, використовуючи ваш набір даних. 
# 5.	Збережіть діаграму  та надішліть її Аллану ( Allan.Henrysson@ssb.no ) до початку наступної сесії (25 січня) та/або підготуйтеся представити свою діаграму (максимум 2 хвилини) у перший день  нового курсу.
