#### День 4: Вправа 7 ####

# Під час вправ використовуйте вектор ("oblast")
oblast <- c ("Vinnytsya", "Volyn", "Dnipropetrovsk", "Donetsk", "Zhytomyr")

# 1) Витягніть елементи 2 і 3 з вектора "oblast" за допомогою індексації



# 2) Витягніть всі елементи у векторі, крім індексу 2 ("Volyn")



# 3) Скористайтеся функцією "match()", щоб знайти який індекс "Donetsk" є у векторі.



# 4) Змініть елемент "Donetsk" у векторі на "Zakarpattya"



# 5) Створіть "list", що містить вектор "oblast" (який вже використовувався раніше) та кількість населення за областями
# population = c(1538331, 1028693, 3173339, 1208981, 1250958)



# 6) Витягніть/надрукуйте вектор населення з даного переліку.



# 7) Конвертуйте даний перелік в набір даних "tibble".



# 8) У наборі даних "tibble" витягніть елемент у рядку 2 та стовпці 1 






##############################################################################
# День 4: Вправа 8
# Під час цієї вправи використовуйте ті ж самі дані вектура "oblast" що й в попередній вправі
oblast_df <- tibble( 
  oblast = c("Vinnytsya", "Volyn", "Dnipropetrovsk", "Zakarpattya", "Zhytomyr"), 
  population = c(1538331, 1028693, 3173339, 1208981, 1250958))

# 1) Створіть вектор з 5 випадкових чисел від 0 до 1.



# 2) Відсортуйте набір даних "oblast" (рядки) на основі випадкових чисел, вказаних у попередньому пункті.



# 3) Напишіть речення "if", щоб побачити, чи є в наборі даних область "Donetsk"
# Якщо так, надрукуйте "Donetsk is in the dataset"
# (Якщо ні, то нічого робити не потрібно)



# 4) Напишіть речення "if", щоб побачити, чи є там кількість населення, що перевищує 2 мільйони
# Підказка: використовуйте "any()", щоб визначити, чи видає у тестовому векторі "TRUE"



# 5) Напишіть "for-loop" для перегляду рядків набору даних.
# Якщо кількість населення перевищує 2 мільйони, надрукуйте назву області та "is greater than 2 million"/"перевищує 2 мільйони".
# Якщо чисельність населення менше 2 мільйонів, надрукуйте назву області та "is less than 2 million"/"менше, ніж 2 мільйони".


