#### День 5: Вправа 9 ####

# 1) Створіть функцію з одним (числовим) вхідним параметром.
# Нехай функція видає "high", якщо вхідне значення більше 100 або навпаки нижче



# 2) Перейдіть до функції та протестуйте її за допомогою вхідних даних 70 і 120.
# Чи працює функція, якщо у якості вхідних даних є вектор? (наприклад, "c(70, 120))



# 3) Додайте до функції другий параметр, який буде пороговим значенням для "low та "high". 
# Використовуйте це значення замість 100, щоб визначити повернене значення



# 4) Додайте значення за замовчуванням до порогового параметра. Встановіть його на 120.
# Перевірте роботу функції, викликаючи її з різними значеннями



# 5) Додайте контроль до функції, щоб отримати попереджувальне повідомлення, якщо вхідні дані є від’ємним числом.
# Чи працює ваша функція й досі з вектором у якості вхідних даних?



# 6) Зчитайте набір даних "employees.csv" у R (знаходиться у папці "data")



# 7) Створіть нову змінну в наборі даних "employees", використовуючи функцію з п.5).
# Нова змінна має базуватися на кількості працівників у 2017 році.





#######################################################################
# День 5: Вправа 10

# 1) Відкрийте документ "RMarkdown" за допомогою шаблону панелі інструментів



# 2) Побудуйте один або кілька графіків



# 3) Запустіть документ за допомогою "knitr"



