# Вступний курс з питань R. Вправи
# День 1


#### Вправа 1 ####


# а) Сума 4499 та 35?



# b) Знайдіть файл довідки для функції sqrt (). Що він робить?



# в) Що робить функція floor()? Яка відповідь для floor(2.48)




# d) Створіть об’єкт, який містить рядок із назвою області (регіону). Виведіть об'єкт на консоль (Run)



# e) Вставте об'єкт область разом із рядком "область"



# f) Створіть вектор із 3 різними числами (цілими числами). Назвіть цей вектор: працівники



# g) Знайдіть файл довідки для функції length()


# h) Перевірте довжину вектора «працівники» за допомогою функції length ()










################################################### #######################################

#### Вправа 2 ####

# Використовуйте наступний вектор для вправи 2 a) та b) (або той, який ви створили під час попередньої вправи)
працівники <- c (3, 20, 14)

# а) Напишіть умову/тест, щоб перевірити, які з елементів у векторі «працівники» - менше 5



# b) Напишіть тест, щоб перевірити, чи містить вектор «працівники» число 9



# c) Оберіть бібліотеку tidyverse




# d) Відкрийте набір даних "employees.csv", без зчитування його. 
# Який роздільник там застосовується?
# Примітка: Набір даних знаходиться в папці даних сховища. Вона вміщує кількість працівників в Україні по роках за групами промисловості.
# Підказка: знайдіть набір даних у розділі Files та натисніть на нього. Оберіть " View File"



# e) Зчитайте набір даних "employees.csv"
# Підказка: Не забувайте застосовувати " " щодо шляху та імені файлу.



# f) Перевірте набір даних. Скільки в ньому змінних?



# g) Який тип змінних відноситься до промисловості?



# h) Яка найменша кількість працівників у кожній групі промисловості у 2017 році?


