# День 6, Вправи

#### Вправа 11 ####

# 1) Задокументуйте свою функцію, з якою ви працювали вчора (вправа 9, частина 5), використовуючи "roxygen".
# Опишіть вхідні параметри й те, що повертає функція
# Додайте приклад, використовуючи "@example"
# Скористайтеся "@export", щоб дозволити користувачам пакету доступ до функції


# 2) Збережіть функцію у новому окремому файлі



# 3) Створіть новий пакет та включіть цю функцію в пакет



# 4) Змініть файл "DESCRPITION", включивши до нього опис пакету.
# Додайте своє ім'я у якості "maintainer"



# 5) Створіть свій пакет та перевірте файл довідки



# 6) *Факультативно*
# Створіть сховище на "Github" для вашого пакету
# Скопіюйте вміст вашого пакету до сховища й натисніть "commit" та "push"



